waveonly/wavemakerBased/IrregularWaves/I14_0degMeasured/constant/wavemakerMovementDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v2212                                     |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/";
    object      waveDict;
}
//---------------------------------------------------------------------------*//

wavemakerType   Flap;
nPaddles   1;
genAbs          1;
hingeHeight    -1.500000;

timeSeries 16501(
0.000000
0.100000
0.200000
0.300000
0.400000
0.500000
0.600000
0.700000
0.800000
0.900000
1.000000
1.100000
1.200000
1.300000
1.400000
1.500000
1.600000
1.700000
1.800000
1.900000
2.000000
2.100000
2.200000
2.300000
2.400000
2.500000
2.600000
2.700000
2.800000
2.900000
3.000000
3.100000
3.200000
3.300000
3.400000
3.500000
3.600000
3.700000
3.800000
3.900000
4.000000
4.100000
4.200000
4.300000
4.400000
4.500000
4.600000
4.700000
4.800000
4.900000
5.000000
5.100000
5.200000
5.300000
5.400000
5.500000
5.600000
5.700000
5.800000
5.900000
6.000000
6.100000
6.200000
6.300000
6.400000
6.500000
6.600000
6.700000
6.800000
6.900000
7.000000
7.100000
7.200000
7.300000
7.400000
7.500000
7.600000
7.700000
7.800000
7.900000
8.000000
8.100000
8.200000
8.300000
8.400000
8.500000
8.600000
8.700000
8.800000
8.900000
9.000000
9.100000
9.200000
9.300000
9.400000
9.500000
9.600000
9.700000
9.800000
9.900000
...
);

paddleTilt 1(
16501(
0.000000
0.038405
0.048714
0.027663
-0.001069
-0.004738
0.013877
0.021298
0.002078
-0.035173
-0.097476
-0.205550
-0.349100
-0.493708
-0.636814
-0.799856
-0.951151
-0.995319
-0.866684
-0.589962
-0.229265
0.176759
0.605298
1.015127
1.348478
1.547985
1.574206
1.440041
1.220487
0.988071
0.747813
0.470708
0.158089
-0.180650
-0.567141
-0.987979
-1.327680
-1.462324
-1.390205
-1.183128
-0.870639
-0.497998
-0.226164
-0.185923
-0.258990
-0.197293
0.019356
0.207507
0.300434
0.414972
0.577318
0.625609
0.461263
0.193181
-0.053497
-0.290899
-0.544781
-0.742680
-0.803671
-0.684104
-0.287561
0.461634
1.364250
1.977661
2.032807
1.650995
1.064697
0.366943
-0.314604
-0.679917
-0.585512
-0.339556
-0.361288
-0.634922
-0.785175
-0.635335
-0.395832
-0.298657
-0.324947
-0.365348
-0.428956
-0.583664
-0.818074
-1.034545
-1.098410
-0.893095
-0.442964
0.017882
0.228646
0.171378
0.057458
0.068686
0.246862
0.614791
1.213805
1.963129
2.624511
2.977754
2.943319
...
);
